In [1]:
import pandas as pd

In [4]:
titanic =pd.read_csv("../datasets/titanic.csv")

In [7]:
titanic.Age.isnull().sum()

177

In [9]:
titanic[titanic.Age.isnull()].Age

5     NaN
17    NaN
19    NaN
26    NaN
28    NaN
       ..
859   NaN
863   NaN
868   NaN
878   NaN
888   NaN
Name: Age, Length: 177, dtype: float64

In [11]:
titanic[titanic.Embarked.isnull()].Embarked

61     NaN
829    NaN
Name: Embarked, dtype: object

In [13]:
df=titanic.fillna(titanic.Age.mean())

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [15]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [16]:
titanic["Age"]=titanic["Age"].fillna(titanic.Age.mean())

In [17]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [18]:
titanic =pd.read_csv("../datasets/titanic.csv")

In [19]:
titanic[titanic.Age.isnull()].Age

5     NaN
17    NaN
19    NaN
26    NaN
28    NaN
       ..
859   NaN
863   NaN
868   NaN
878   NaN
888   NaN
Name: Age, Length: 177, dtype: float64

In [21]:
titanic.Age.interpolate()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    22.5
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [22]:
titanic.Age.interpolate().isnull().sum()

0

In [23]:
titanic.Age.interpolate().iloc[3:7]

3    35.0
4    35.0
5    44.5
6    54.0
Name: Age, dtype: float64

In [24]:
titanic.Age.iloc[3:7]

3    35.0
4    35.0
5     NaN
6    54.0
Name: Age, dtype: float64

In [28]:
titanic.Age.interpolate(inplace=True)

In [26]:
titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
import numpy as np

In [31]:
x=np.array([4,5,np.nan,np.nan,np.nan,34,6])

In [32]:
x

array([ 4.,  5., nan, nan, nan, 34.,  6.])

In [34]:
df2=pd.DataFrame(x)

In [35]:
df2

      0
0   4.0
1   5.0
2   NaN
3   NaN
4   NaN
5  34.0
6   6.0

In [36]:
df2.interpolate()

       0
0   4.00
1   5.00
2  12.25
3  19.50
4  26.75
5  34.00
6   6.00

In [37]:
df3=pd.DataFrame(x)

In [38]:
np.array([5,6,"",6,6,""])

array(['5', '6', '', '6', '6', ''], dtype='<U21')

In [39]:
np.array([5,6,None,6,6,None])

array([5, 6, None, 6, 6, None], dtype=object)

In [43]:
pd.DataFrame(np.array([5,6,None,6,6,None]))

      0
0     5
1     6
2  None
3     6
4     6
5  None

In [44]:
df3.interpolate(method="quadratic")

           0
0   4.000000
1   5.000000
2  14.033333
3  31.100000
4  42.366667
5  34.000000
6   6.000000

In [45]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,22.5,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [46]:
df4=titanic.drop(labels=["Name"])

KeyError: "['Name'] not found in axis"

In [47]:
df4=titanic.drop(labels=["Name"],axis=1)

In [48]:
df4.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
df5=titanic.drop(labels=["Name","Sex","Age"],axis=1)

In [50]:
df5

,PassengerId,Survived,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,1,0,PC 17599,71.2833,C85,C
2,3,1,3,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,1,0,113803,53.1000,C123,S
4,5,0,3,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,0,0,211536,13.0000,NaN,S
887,888,1,1,0,0,112053,30.0000,B42,S
888,889,0,3,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,0,0,111369,30.0000,C148,C
890,891,0,3,0,0,370376,7.7500,NaN,Q